Repository: AbrahmAB/sugarlabs-calculate
Catalog: po/*.po
Languages: ur

source: Calculate
ur: شمار کريں

source: Available functions:
ur: موجود فنکشن

source: help_acos
ur: آ کوس کی مدد کے ليے

source: help_asin
ur: آ سائن کی مدد کے ليے

source: help_exp
ur: ای ايکس پی کی مدد کے ليے

source: help_functions
ur: مدد کے فنکشن

source: help_operators
ur: مدد والے آپريٹرز

source: help_plot
ur: پلاٹ کی مدد

source: help_sqrt
ur: سکوئر کی مدد کے ليے

source: help_test
ur: ٹيسٹ_ مدد

source: help_variables
ur: ويری ايبل_مدد

source: help_usage
ur: استعمال-مدد

source: help_var
ur: وار-مدد

source: Topics:
ur: عنوانات

source: Type error
ur: لکھنے کی غلطی

source: Error at %d
ur: ٪ ڈی پر غلطی

source: variable %s not defined
ur: ويری ايبل ٪ لکھيں نہيں ہيں

source: Function '%s' not defined
ur: فنکشن ٪ لکھيں نہيں ہيں

source: Invalid number of arguments (%d instead of %d)
ur: دلائل غلط ہيں (٪ کی جگہ ٪)

source: function takes %d args
ur: فنکشن ٪ اے آر جی ايس ليتے ہيں

source: Unable to parse argument %d: '%s'
ur: آرگيومينٹ کو پارس کرنے سے معزور ٪ڈی "٪ايس"

source: Function error: %s
ur: فنکشن کی غلطی: ٪ايس

source: Function '%s' returned %s
ur: فنکشن "٪ايس" واپس آيا ٪ايس

source: Variable '%s' undefined
ur: ويری ايبل ٪ايس نہيں لکھا

source: Parse error (right parenthesis)
ur: پارس کی غلطی( دايں بريکٹيں)

source: Right parenthesis unexpected
ur: دايں غير متوقع بريکٹيں

source: Parse error (right parenthesis, no left_val)
ur: پارس کی غلطی(دايں بريکٹ، نہ باياں-وال)

source: Parse error (right parenthesis, no level to close)
ur: پارس کی غلطی(دايں بريکٹ، حصہ بند نہ کريں)

source: Number not expected
ur: عدد متوقع نہيں

source: Invalid operator
ur: غلط اوپريٹر

source: Parse error: ')' expected
ur: پارس غلطی:"(" متوقع

source: _parse(): returning None
ur: -پارس()کچہ واپس نہ آيا

source: clear
ur: صاف کرنا

source: enter
ur: ڈالنا

source: Edit
ur: مرتب کرنا

source: Algebra
ur: الجبرہ

source: Trigonometry
ur: علم مثلثات

source: Boolean
ur: بولئين

source: Format
ur: شکل

source: Label:
ur: نشان

source: All equations
ur: تمام عوامل

source: My equations
ur: ميرے عوامل

source: Show history
ur: تاريخ دکھائيں

source: Show variables
ur: ويری ايبل ديکھائيں

source: Error
ur: غلطی

source: Error: unsupported type
ur: غلطی: سپورٹڈ نمونہ ہے

source: Unable to parse range
ur: پارس کی حد ظاہر کرنے سے قاصر

source: Copy
ur: نقل کريں

source: Paste
ur: جوڑيں

source: Cut
ur: کاٹيں

source: Equation.parse() string invalid (%s)
ur: مساوات جبريہ۔پارس() غلط عبارت

source: Writing to journal (%s)
ur: روذنامچہ ميں لکھنا(٪)

source: Reading from journal (%s)
ur: روذنامچہ سے پڑھنا(٪)

source: Unable to determine version
ur: ورژن سمجھنے ميں قاصر

source: Reading journal entry (version %s)
ur: روزنامچہ سے پڑھنا(ورژن ٪)

source: State line invalid (%s)
ur: سيدھی لکير غلط ہے(٪)

source: Unable to read journal entry, unknown version (%s)
ur: روزنامچہ ميں سے پڑھنے سے قاصر، ورژن معلوم نہيں(٪)

source: button_pressed(): invalid type
ur: بٹن_دبايا():غلط قسم

source: level: %d, ofs %d
ur: ليول:٪ڈی،او ايف ايس ٪ڈی

source: Variable '%s' not defined
ur: ويری ايبل "٪ايس" نہيں لکھا

source: Operator not expected
ur: اوپريٹر متوقع نہيں تھا

source: Operator expected
ur: متوقع اوپريٹر

source: help_cos
ur: قوس_مدد

source: help_sin
ur: سائن_مدد

source: Topics
ur: مضامين

source: thousand_sep
ur: ہزاروں_ايس ای پی

source: fraction_sep
ur: فريکشن_ايس ای پی

source: mul_sym
ur: ضرب_ايس وائی ايم

source: div_sym
ur: تقسيم
