Repository: AbrahmAB/sugarlabs-calculate
Catalog: po/aym.po
Languages: aym

source: Calculate
aym: Jakhthapiña

source: plot(eqn, var=-a..b), plot the equation 'eqn' with the variable 'var' in the range from a to b
aym: plot(eqn, var=-a..b), 'eqn' jakhjaña apsuña uka 'var' sata wakisiri mayjt'ayirinakampi, uka 'a' ukata 'b' wakichatkama

source: Parse error at %d
aym: Wakichatanaka thaqtañana pantjata %d

source: Error at %d
aym: Pantjatawa utji %d

source: This is just a test topic, use help(index) for the index
aym: Akaxa yantawikiwa, uñjañamawa yanapt'awi(indice) qalltuwitakixa

source: index
aym: qalltuwi

source: topics
aym: amuytawinaka

source: Topics
aym: Amuytawinaka

source: functions
aym: lurañataki

source: Functions
aym: Lurañataki

source: No help about '%s' available, use help(index) for the index
aym: Janiwa yanapt'awixa utxiti '%s' ukatakixa, apnaqasmawa yanapt'awi(índice) qalltañawitakixa

source: help
aym: yanapt'awi

source: Recursion detected
aym: Jaljtawixa uñjatawa

source: Function '%s' not defined
aym: '%s' lurawixa janiwa amtutakiti

source: Variable '%s' not defined
aym: Variable '%s' janiwa amtutakiti

source: Attribute '%s' does not exist
aym: Atributo '%s' janiwa utjiti

source: Parse error
aym: Pantjata amuyt'awixa

source: Multiple statements not supported
aym: Janiwa walja amtuwixa lurasiñapakiti

source: Internal error
aym: Kikipana pantjata

source: Equation.parse() string invalid (%s)
aym: Equation.parse() jani amtuta (%s)

source: Can not assign label: will cause recursion
aym: Janiwa sutiyañjamakiti: jaljtayasiniwa

source: Writing to journal (%s)
aym: Sapüru luräwiru qilqantaña (%s)

source: button_pressed(): invalid type
aym: button_pressed(): kut'ayata casta

source: add
aym: yapxataña

source: and
aym: ukata

source: gcd
aym: mcd

source: factorize
aym: factorizar

source: floor
aym: uraqi

source: round
aym: phuqaña

source: square
aym: kajuna

source: abs(x), return absolute value of x, which means -x for x < 0
aym: abs(x), kutiyaniwa ukhamatixa x, ukasti saña muniwa -x ukaxa x < 0

source: acos(x), return the arc cosine of x. This is the angle for which the cosine is x. Defined for -1 <= x < 1
aym: acos(x), kutiyaniwa kurmi coseno x ukata, ukaxa kuchu ukatakisti coseno ukaxa x. ukataki -1 <= x < 1

source: acosh(x), return the arc hyperbolic cosine of x. This is the value y for which the hyperbolic cosine equals x.
aym: acosh(x), kurmi coseno hiperbólico kutiyaniwa x ukata, ukaxa y ukawa kataqixa coseno hiperbólico x ukawa.

source: And(x, y), logical and. Returns True if x and y are True, else returns False
aym: And(x, y), and logico, chiqapa kutiyaniniwa x ukhamaraki e chikapipana, jani ukasti q'ari kutiyaniwa

source: add(x, y), return x + y
aym: yapxataña(x, y), kutiyaniwa x + y

source: asin(x), return the arc sine of x. This is the angle for which the sine is x. Defined for -1 <= x <= 1
aym: asin(x), kutiyaniwa kurmi seno x ukata, ukaxa kuchu ukatakisti seno ukaxa x. ukataki -1 <= x <= 1

source: asinh(x), return the arc hyperbolic sine of x. This is the value y for which the hyperbolic sine equals x.
aym: asinh(x), kurmi seno hiperbólico kutiyaniwa x ukata, Ukaxa y ukawa kataqixa seno hiperbólico x ukawa.

source: atan(x), return the arc tangent of x. This is the angle for which the tangent is x. Defined for all x
aym: atan(x), kutiyaniwa kurmi tangente x ukata, ukaxa kuchu ukatakisti tangete ukaxa x. ukataki -1 <= x < 1

source: atanh(x), return the arc hyperbolic tangent of x. This is the value y for which the hyperbolic tangent equals x.
aym: atanh(x), kurmi tangente hiperbólico kutiyaniwa x ukata, Ukaxa y ukawa kataqixa tangente hiperbólico x ukawa.

source: Number does not look binary in base 10
aym: Jakhuxa janiwa binario en base 10 wakisiti

source: b10bin(x), interpret a number written in base 10 as binary, e.g.: b10bin(10111) = 23,
aym: b10bin(x), qhananchaña jakhu base 10 qillqata binario ukhamaru, b10bin(10111) = 23,

source: ceil(x), return the smallest integer larger than x.
aym: ceil(x), kutiyaniwa sullka phuqata jhaku jila x ukata.

source: cos(x), return the cosine of x. This is the x-coordinate on the unit circle at the angle x
aym: cos(x), kutiyaniwa coseno x ukata. Ukaxa coordena x muyuna ukankiwa uka mayakiwa k'uchu x ukaxa

source: cosh(x), return the hyperbolic cosine of x. Given by (exp(x) + exp(-x)) / 2
aym: cosh(x), kutiyaniwal coseno hiperbólico x ukata. (exp(x) + exp(-x)) / 2

source: Can not divide by zero
aym: Ch'usaxa janiwa jaljayasiti

source: Invalid argument
aym: Jani wakisiri Amuyt'äwi

source: gcd(a, b), determine the greatest common denominator of a and b. For example, the biggest factor that is shared by the numbers 15 and 18 is 3.
aym: gcd(a, b), tantiyiwa a ukhamaraki b jila jaljayiripa. kunjamatixa 3 Jakhu jaljtayixa 15 ukhamaraki 18 jakhunakaru.

source: exp(x), return the natural exponent of x. Given by e^x
aym: exp(x), kutiyaniwa x jakhu piq'iñchiripa Yatita. e^x ukata churanita

source: Factorial only defined for integers
aym: Factorial phuqatanakakiwa ukaxa

source: factorial(n), return the factorial of n. Given by n * (n - 1) * (n - 2) * ...
aym: factorial(x), kutiyaniwa factorial x ukata, x * (x - 1) * (x - 2) * ukata churata ...

source: fac(x), return the factorial of x. Given by x * (x - 1) * (x - 2) * ...
aym: fac(x), kutiyaniwa factorial x ukata, x * (x - 1) * (x - 2) * ukata churata ...

source: floor(x), return the largest integer smaller than x.
aym: floor(x), kutiyaniwa jila phuxach'ata x arkiripa.

source: inv(x), return the inverse of x, which is 1 / x
aym: inv(x), kutiyaniwa mayniripa x, 1 / x ukhamarakiwa

source: Logarithm(x) only defined for x > 0
aym: Logarithm(x) akatakiwa x > 0

source: ln(x), return the natural logarithm of x. This is the value for which the exponent exp() equals x. Defined for x >= 0.
aym: ln(x), kutiyaniwa Yatita algoritmo x ukata. exp() piq'iñchiripaxa x kikipakiwa. x >= 0 akatakiwa.

source: log10(x), return the base 10 logarithm of x. This is the value y for which 10^y equals x. Defined for x >= 0.
aym: log10(x), kutiyaniwa logaritmo x base 10 ukana. Akaxa 10^y kikipakiwa x ukampixa. akatakiwa x>=0.

source: Can only calculate x modulo <integer>
aym: x modulo tantiyañakiwa <integer>

source: mod(x, y), return the modulus of x with respect to y. This is the remainder after dividing x by y.
aym: mod(x, y), kutiyaniwa módulo x ukata y. Akaxa jilt'awax jaljayawita y ukharu.

source: mul(x, y), return x * y
aym: mul(x, y), kutiyaniwa x * y

source: negate(x), return -x
aym: negate(x), kutiyaniwa -x

source: Or(x, y), logical or. Returns True if x or y is True, else returns False
aym: Or(x, y), 'o' logico, kutiyaninwa chikqapa x y/o chiqapipana y ukhamaraki, janiukhaxa k'ari kutiyaniwa

source: pow(x, y), return x to the power y (x**y)
aym: pow(x, y), x kutiyaniwa y piqiñch'at'aru (x**y)

source: rand_float(), return a random floating point number between 0.0 and 1.0
aym: rand_float(), kutiyaniwa Jakhu kawkirixita 0.0 ukhampita 1.0

source: rand_int([<maxval>]), return a random integer between 0 and <maxval>. <maxval> is an optional argument and is set to 65535 by default.
aym: rand_int([<maxval>]), kutiyaniwa kawkiri phuqata jhakhuwi 0 ukhamaraki <maxval>.<maxval> uka amuyt'awixa 65535 akatxamata uñasiriwa.

source: round(x), return the integer nearest to x.
aym: round(x), kutiyaniwa phuqata x jak'anqiri.

source: Bitwise operations only apply to integers
aym: Bits lurawinakaxa phuqatanatakiwa

source: shift_left(x, y), shift x by y bits to the left (multiply by 2 per bit)
aym: shift_left(x, y), x chiqaru jithjtayaña bits ukaru (payptayiwa sapa maya bit)

source: shift_right(x, y), shift x by y bits to the right (divide by 2 per bit)
aym: shift_right(x, y), x kupiru jithjtayaña bits ukaru (payptayiwa sapa maya bit)

source: sin(x), return the sine of x. This is the y-coordinate on the unit circle at the angle x
aym: sin(x), kutiyiwa seno x ukata. Ukaxa coordinada ukhamaraki sapa muyuna x k'uchu ukana

source: sinh(x), return the hyperbolic sine of x. Given by (exp(x) - exp(-x)) / 2
aym: inh(x), kutiyiwa x ukata seno hiperbolico. (exp(x) - exp(-x)) / 2 ukampi churata

source: sinc(x), return the sinc of x. This is given by sin(x) / x.
aym: sinc(x), kutiyiwa seno cardinal x ukata. sin(x) / x ukampi churata.

source: sqrt(x), return the square root of x. This is the value for which the square equals x. Defined for x >= 0.
aym: sqrt(x) kituyiwa x raiz cuadrada chanipa. axa Aka chanixa Kikipakiwa x ukampi.x >= 0 ukatakiwa.

source: square(x), return x * x
aym: cuadrado(x), kutiyiwa x * x

source: sub(x, y), return x - y
aym: sub(x, y), kutiyiwa x - y

source: tan(x), return the tangent of x. This is the slope of the line from the origin of the unit circle to the point on the unit circle defined by the angle x. Given by sin(x) / cos(x)
aym: tan(x), kutiyaniwa tangente x chanipa. akaxa Chiqaru amsta sapa muyu qalltuta x k'uchuta muyu chanich'atkama. sin(x) / cos(x) ukampi churata

source: tanh(x), return the hyperbolic tangent of x. Given by sinh(x) / cosh(x)
aym: tanh(x), kutiyaniwa tangente hiperbolica x chanita. sinh(x) / cosh(x) ukampi churata

source: xor(x, y), logical xor. Returns True if either x is True (and y is False) or y is True (and x is False), else returns False
aym: xor(x, y), xor logico. chiqapa kutiyaniniwa x chani chiqapipana (y k'aripana) jani ukasti y chiqapipana ( x es k'aripana), jani ukasti kutiyaniniwa k'ari

source: Clear
aym: Pichsuña

source: Edit
aym: Chiqachaña

source: Trigonometry
aym: Trigonometría

source: Boolean
aym: Chiqapa/k'ari

source: Miscellaneous
aym: Kunaymana

source: Label:
aym: Chimpunaka:

source: All equations
aym: Qawayata ecuaciones

source: My equations
aym: Nayankiri ecuaciones

source: Change view between own and all equations
aym: Mayxata Unjaña nayankiri ukhamaraki qawayata ecuaciones

source: Show history
aym: Lurata uñachayaña

source: Show variables
aym: Variable Uñachayaña

source: Change view between history and variables
aym: Mayxata lurawi ukhamaraki variable uñjaña

source: Undefined
aym: Jani amuyata

source: Error: unsupported type
aym: Pantjata: kut'ayata casta

source: Help
aym: Yanapt'awi

source: Copy
aym: Talliqaña

source: Cut
aym: Apaqaña

source: Paste
aym: Lip'iyaña

source: Square
aym: Payanchaña

source: Square root
aym: Raíz cuadrada

source: Inverse
aym: Yaqapa

source: e to the power x
aym: e piq'inchaña x ukaru

source: x to the power y
aym: x piq'inchaña y ukaru

source: Natural logarithm
aym: Logaritmo yatita

source: Sine
aym: Seno

source: Cosine
aym: Coseno

source: Tangent
aym: Tangente

source: Arc sine
aym: Arcoseno

source: Arc cosine
aym: Arcocoseno

source: Arc tangent
aym: Arcotangente

source: Hyperbolic sine
aym: Seno hiperbólico

source: Hyperbolic cosine
aym: Coseno hiperbólico

source: Hyperbolic tangent
aym: Tangente hiperbólica

source: Logical and
aym: Y lógico

source: Logical or
aym: O lógico

source: Equals
aym: Kikipa

source: Not equals
aym: Mayxa

source: Plot
aym: Jirsuwi

source: Degrees
aym: Grados

source: Radians
aym: Radianes

source: Degrees / Radians
aym: Grados / Radianes

source: Exponent / Scientific notation
aym: Exponente / Notación científica

source: Number of shown digits
aym: Jakhunakana jakhupa uñachayata

source: Integer formatting base
aym: Jhakhunaka base
